Jhnatek/sjtwo-c2/projects/lpc40xx_freertos/l5_application/main.c
#include <stdio.h>

#include "FreeRTOS.h"
#include "task.h"

#include "board_io.h"
#include "common_macros.h"
#include "periodic_scheduler.h"
#include "sj2_cli.h"

// lab 3:
#include "gpio_lab.h"

// 'static' to make these functions 'private' to this file
static void create_blinky_tasks(void);
static void create_uart_task(void);
static void blink_task(void *params);
static void uart_task(void *params);

// lab 2
/*
static void task_one(void *task_parameter) {
  while (true) {
    // Read existing main.c regarding when we should use fprintf(stderr...) in place of printf()
    // For this lab, we will use fprintf(stderr, ...)
    fprintf(stderr, "AAAAAAAAAAAA");

    // Sleep for 100ms
    vTaskDelay(100);
  }
}

static void task_two(void *task_parameter) {
  while (true) {
    fprintf(stderr, "bbbbbbbbbbbb");
    vTaskDelay(100);
  }
} */

// lab 3:
#include "LPC40xx.h"
#include "semphr.h"
static SemaphoreHandle_t switch_press_indication;
static SemaphoreHandle_t switch_press_secret;
// lab 3 part 2:
typedef struct {
  // First get gpio0 driver to work only, and if you finish it
  // you can do the extra credit to also make it work for other Ports
  //
  uint8_t port;
  uint8_t pin;
} port_pin_s;
/*
void led_task(void *task_parameter) {
  // Type-cast the paramter that was passed from xTaskCreate()
  const port_pin_s *led = (port_pin_s *)(task_parameter);

  while (true) {
    gpiO__set_high(led->port, led->pin);
    printf("%d: HIGH\n", led->port);
    vTaskDelay(100);

    gpiO__set_low(led->port, led->pin);
    printf("%d: low\n", led->port);
    vTaskDelay(100);
  }
} */

/*
lab 3, part 1:
void led_task(void *pvParameters) {
  // Choose one of the onboard LEDS by looking into schematics and write code for the below
  // 0) Set the IOCON MUX function(if required) select pins to 000
  // works:
  // LPC_GPIO2->DIR |= (1 << 3);
  // 1) Set the DIR register bit for the LED port pin
  gpiO__set_as_output(2, 3);
  while (true) {
    // 2) Set PIN register bit to 0 to turn ON LED (led may be active low)
    // Works:
    // LPC_GPIO2->PIN |= (1 << 3);
    // printf("HIGH");
    // printf("%p\n", &(LPC_GPIO2->PIN));
    gpiO__set_high(2, 3);
    vTaskDelay(100);

    // 3) Set PIN register bit to 1 to turn OFF LED
    // Works:
    // LPC_GPIO2->PIN &= ~(1 << 3);
    // printf("low");
    // printf("%p\n", &(LPC_GPIO2->PIN));
    gpiO__set_low(2, 3);
    vTaskDelay(100);
  }
} */

// lab 3 part 3:
void led_task(void *task_parameter) {
  const port_pin_s *led = (port_pin_s *)(task_parameter);
  while (true) {
    // Note: There is no vTaskDelay() here, but we use sleep mechanism while waiting for the binary semaphore (signal)
    if (xSemaphoreTake(switch_press_indication, 1000)) {
      // Blinks the LED you set in main 2 times, will usually end up with 4
      /*
      gpiO__set_high(led->port, led->pin);
      vTaskDelay(200);
      gpiO__set_low(led->port, led->pin);
      vTaskDelay(200);
      gpiO__set_high(led->port, led->pin);
      vTaskDelay(200);
      gpiO__set_low(led->port, led->pin);
      vTaskDelay(200);
      */

      // fancy blink
      xSemaphoreGive(switch_press_secret);
      gpiO__set_low(1, 18);
      vTaskDelay(100);
      gpiO__set_low(1, 24);
      vTaskDelay(100);
      gpiO__set_low(1, 26);
      vTaskDelay(100);
      gpiO__set_low(2, 3);
      vTaskDelay(100);
      gpiO__set_high(1, 18);
      vTaskDelay(100);
      gpiO__set_high(1, 24);
      vTaskDelay(100);
      gpiO__set_high(1, 26);
      vTaskDelay(100);
      gpiO__set_high(2, 3);
      vTaskDelay(100);
      gpiO__set_low(2, 3);
      vTaskDelay(100);
      gpiO__set_low(1, 26);
      vTaskDelay(100);
      gpiO__set_low(1, 24);
      vTaskDelay(100);
      gpiO__set_low(1, 18);
      vTaskDelay(100);
      gpiO__set_high(1, 26);
      gpiO__set_high(1, 24);
      vTaskDelay(100);
      gpiO__set_high(2, 3);
      gpiO__set_high(1, 18);
      vTaskDelay(100); //
      gpiO__set_low(1, 26);
      gpiO__set_low(1, 24);
      vTaskDelay(100);
      gpiO__set_low(2, 3);
      gpiO__set_low(1, 18);
      vTaskDelay(100);
      gpiO__set_high(1, 26);
      gpiO__set_high(1, 24);
      vTaskDelay(100);
      gpiO__set_high(2, 3);
      gpiO__set_high(1, 18);
      vTaskDelay(100); //
      gpiO__set_low(1, 26);
      gpiO__set_low(1, 24);
      vTaskDelay(100);
      gpiO__set_low(2, 3);
      gpiO__set_low(1, 18);
      vTaskDelay(100);
      gpiO__set_high(1, 26);
      gpiO__set_high(1, 24);
      vTaskDelay(100);
      gpiO__set_high(2, 3);
      gpiO__set_high(1, 18);
      vTaskDelay(100);

    } else {
      puts("Timeout: No switch press indication for 1000ms");
    }
  }
}

// attempt at secret button
void secret_button(void *task_parameter) {
  const port_pin_s *secret = (port_pin_s *)(task_parameter);
  while (true) {
    if (xSemaphoreTake(switch_press_secret, 3000)) {
      if (gpiO__get_level(secret->port, secret->pin)) {
        for (int i = 0; i < 10; i++) {
          gpiO__set_low(1, 18);
          gpiO__set_low(1, 24);
          gpiO__set_low(1, 26);
          gpiO__set_low(2, 3);
          vTaskDelay(100);
          gpiO__set_high(1, 18);
          gpiO__set_high(1, 24);
          gpiO__set_high(1, 26);
          gpiO__set_high(2, 3);
          vTaskDelay(100);
        }
      }
    }
  }
}

void switch_task(void *task_parameter) {
  port_pin_s *switch1 = (port_pin_s *)task_parameter;

  while (true) {
    // TODO: If switch pressed, set the binary semaphore
    if (gpiO__get_level(switch1->port, switch1->pin)) {
      xSemaphoreGive(switch_press_indication);
    }

    // Task should always sleep otherwise they will use 100% CPU
    // This task sleep also helps avoid spurious semaphore give during switch debeounce
    vTaskDelay(100);
  }
}

// flash: python nxp-programmer/flash.py

int main(void) {
  switch_press_indication = xSemaphoreCreateBinary();
  switch_press_secret = xSemaphoreCreateBinary();
  // create_blinky_tasks(); This has always been there but I just commented out.
  create_uart_task();

  // If you have the ESP32 wifi module soldered on the board, you can try uncommenting this code
  // See esp32/README.md for more details
  // uart3_init();                                                                     // Also include:  uart3_init.h
  // xTaskCreate(esp32_tcp_hello_world_task, "uart3", 1000, NULL, PRIORITY_LOW, NULL); // Include esp32_task.h

  puts("Starting RTOS,  why hello there world");

  // lab 3 part 2:
  static port_pin_s led0 = {1, 18};
  static port_pin_s switch0 = {1, 19};
  static port_pin_s secret_switch = {0, 30};
  // static port_pin_s led4 = {1, 24};
  xTaskCreate(led_task, "led0", 2048 / sizeof(void *), &led0, PRIORITY_LOW, NULL);
  xTaskCreate(switch_task, "switch0", 2048 / sizeof(void *), &switch0, PRIORITY_LOW, NULL);
  xTaskCreate(secret_button, "secret", 2048 / sizeof(void *), &secret_switch, PRIORITY_LOW, NULL);

  vTaskStartScheduler(); // This function never returns unless RTOS scheduler runs out of memory and fails

  return 0;
}

static void create_blinky_tasks(void) {
  /**
   * Use '#if (1)' if you wish to observe how two tasks can blink LEDs
   * Use '#if (0)' if you wish to use the 'periodic_scheduler.h' that will spawn 4 periodic tasks, one for each LED
   */
#if (1)
  // These variables should not go out of scope because the 'blink_task' will reference this memory
  static gpio_s led0, led1;

  led0 = board_io__get_led0();
  led1 = board_io__get_led1();

  xTaskCreate(blink_task, "led0", configMINIMAL_STACK_SIZE, (void *)&led0, PRIORITY_LOW, NULL);
  // undo the mark out below
  xTaskCreate(blink_task, "led1", configMINIMAL_STACK_SIZE, (void *)&led1, PRIORITY_LOW, NULL);
#else
  const bool run_1000hz = true;
  const size_t stack_size_bytes = 2048 / sizeof(void *); // RTOS stack size is in terms of 32-bits for ARM M4 32-bit CPU
  periodic_scheduler__initialize(stack_size_bytes, !run_1000hz); // Assuming we do not need the high rate 1000Hz task
  UNUSED(blink_task);
#endif
}

static void create_uart_task(void) {
  // It is advised to either run the uart_task, or the SJ2 command-line (CLI), but not both
  // Change '#if (0)' to '#if (1)' and vice versa to try it out
#if (0)
  // printf() takes more stack space, size this tasks' stack higher
  xTaskCreate(uart_task, "uart", (512U * 8) / sizeof(void *), NULL, PRIORITY_LOW, NULL);
#else
  sj2_cli__init();
  UNUSED(uart_task); // uart_task is un-used in if we are doing cli init()
#endif
}

static void blink_task(void *params) {
  const gpio_s led = *((gpio_s *)params); // Parameter was input while calling xTaskCreate()

  // Warning: This task starts with very minimal stack, so do not use printf() API here to avoid stack overflow
  while (true) {
    gpio__toggle(led);
    vTaskDelay(500);
  }
}

// This sends periodic messages over printf() which uses system_calls.c to send them to UART0
static void uart_task(void *params) {
  TickType_t previous_tick = 0;
  TickType_t ticks = 0;

  while (true) {
    // This loop will repeat at precise task delay, even if the logic below takes variable amount of ticks
    vTaskDelayUntil(&previous_tick, 2000);

    /* Calls to fprintf(stderr, ...) uses polled UART driver, so this entire output will be fully
     * sent out before this function returns. See system_calls.c for actual implementation.
     *
     * Use this style print for:
     *  - Interrupts because you cannot use printf() inside an ISR
     *    This is because regular printf() leads down to xQueueSend() that might block
     *    but you cannot block inside an ISR hence the system might crash
     *  - During debugging in case system crashes before all output of printf() is sent
     */
    ticks = xTaskGetTickCount();
    fprintf(stderr, "%u: This is a polled version of printf used for debugging ... finished in", (unsigned)ticks);
    fprintf(stderr, " %lu ticks\n", (xTaskGetTickCount() - ticks));

    /* This deposits data to an outgoing queue and doesn't block the CPU
     * Data will be sent later, but this function would return earlier
     */
    ticks = xTaskGetTickCount();
    printf("This is a more efficient printf ... finished in");
    printf(" %lu ticks\n\n", (xTaskGetTickCount() - ticks));
  }
}
